Revit 2015 API
CompoundStructureLayer Properties
The CompoundStructureLayer type exposes the following members.
Properties
Name | Description
DeckEmbeddingType
 Embedding type for structural deck - only for a layer whose function is StructuralDeck.
DeckProfileId
 The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.
Function
 The function of the layer.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LayerCapFlag
 Identifies if the layer participates in the cap work.
LayerId
 The id of the layer - may be different from the index in the array of layers in a CompoundStructure.
MaterialId
 Id of the material assigned to this layer.
Width
 Width of the layer.
See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace